config/cf/Catalogs/ВидыПричинОтклоненияОтГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ВидыПричинОтклоненияОтГрафика</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектовПричинОтклоненияОтГрафиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БуквенноеОбозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Enums/ТипыОбъектовПричинОтклоненияОтГрафиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ТипыОбъектовПричинОтклоненияОтГрафиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Catalogs/ВидыПричинОтклоненияОтГрафика/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БазовыеЦвета = ЗначениеИзСтрокиВнутр(ПолучитьОбщийМакет("БазовыеЦвета").ПолучитьТекст());
    
	
	Если Объект.Ссылка.Пустая() Тогда
		ЦветФона = РаботаСЦветомКлиентСервер.СлучайныйЦветRALStandart();
        ЦветТекста = РаботаСЦветомКлиентСервер.КонтрастныйЦвет(ЦветФона);
        ТипОбъекта = Перечисления.ТипыОбъектовПричинОтклоненияОтГрафиков.Сервис;
	Иначе
		Попытка
			ЦветФона = РаботаСЦветомКлиентСервер.HexВЦвет(Объект.ЦветФона);			
		Исключение
			ЦветФона = WebЦвета.Белый;
		КонецПопытки;
		Попытка
			ЦветТекста = РаботаСЦветомКлиентСервер.HexВЦвет(Объект.ЦветТекста);			
		Исключение
			ЦветТекста = WebЦвета.Черный;
		КонецПопытки;
    КонецЕсли;
    	
	ОбновитьВидимостьИДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЦветТекста 	= РаботаСЦветомКлиентСервер.ЦветВHex(ЦветТекста);
	ТекущийОбъект.ЦветФона 		= РаботаСЦветомКлиентСервер.ЦветВHex(ЦветФона);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьЦветаСостоянияСотрудников");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РедактируемыйЦветТекстаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Результат = Неопределено;	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("РедактируемыйЦветТекстаНачалоВыбораЗавершение", ЭтотОбъект), БазовыеЦвета, Элемент, БазовыеЦвета.НайтиПоЗначению(ЦветТекста));
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветТекстаНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    Результат = ВыбранныйЭлемент;
    Если Результат <> Неопределено Тогда
		
		Если ТипЗнч(Результат) = Тип("Цвет") Тогда
			ЦветТекста = Результат;
        ИначеЕсли ТипЗнч(Результат.Значение) = Тип("Строка") Тогда
            ПараметрыФормы = Новый Структура("РедактируемыйЦвет", ЦветТекста);
            ОткрытьФорму("ОбщаяФорма.ФормаВыбораЦвета", ПараметрыФормы, Элементы.ЦветТекста,,,, Новый ОписаниеОповещения("РедактируемыйЦветТекстаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Результат", Результат)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
            Возврат;
        Иначе
            ЦветТекста = Результат.Значение;
        КонецЕсли;        
        ОбновитьВидимостьИДоступность();
		
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Цвет") Тогда
		ЦветТекста = ВыбранноеЗначение;		
		ОбновитьВидимостьИДоступность();
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Результат = Неопределено;	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("РедактируемыйЦветФонаНачалоВыбораЗавершение", ЭтотОбъект), БазовыеЦвета, Элемент, БазовыеЦвета.НайтиПоЗначению(ЦветФона));

КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветФонаНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    Результат = ВыбранныйЭлемент;
    Если Результат <> Неопределено Тогда
		
		Если ТипЗнч(Результат) = Тип("Цвет") Тогда
			ЦветФона = Результат;
        ИначеЕсли ТипЗнч(Результат.Значение) = Тип("Строка") Тогда
            ПараметрыФормы = Новый Структура("РедактируемыйЦвет", ЦветФона);
            ОткрытьФорму("ОбщаяФорма.ФормаВыбораЦвета", ПараметрыФормы, Элементы.ЦветФона,,,, Новый ОписаниеОповещения("РедактируемыйЦветФонаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Результат", Результат)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
            Возврат;
        Иначе
            ЦветФона = Результат.Значение;
		КонецЕсли;
		ОбновитьВидимостьИДоступность();
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Цвет") Тогда
		ЦветФона = ВыбранноеЗначение;
		ОбновитьВидимостьИДоступность();
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВидимостьИДоступность()
	
	Элементы.Образец.ЦветТекста = ЦветТекста;
	Элементы.Образец.ЦветФона 	= ЦветФона;
	
КонецПроцедуры

#КонецОбласти
